renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pstdrequest.c
/******************************************************************************
 Function Name   : usb_pstd_stand_req2
 Description     : The control write data stage of a standard request from host.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_stand_req2 (void)
{
    if (USB_SET_DESCRIPTOR == (g_usb_pstd_req_type & USB_BREQUEST))
    {
        /* Set Descriptor2 */
        usb_pstd_set_descriptor2();
    }
    else
    {
        /* Set pipe USB_PID_STALL */
        usb_pstd_set_stall_pipe0();
    }
}
/******************************************************************************
 End of function usb_pstd_stand_req2
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_stand_req3
 Description     : Standard request process. This is for the status stage of a
                 : control write where there is no data stage.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_stand_req3 (void)
{
    usb_ctrl_t ctrl;

    switch ((g_usb_pstd_req_type & USB_BREQUEST))
    {
        case USB_CLEAR_FEATURE :
            usb_pstd_clr_feature3();            /* ClearFeature3 */
        break;
        case USB_SET_FEATURE :
            usb_pstd_set_feature3();            /* SetFeature3 */
        break;
        case USB_SET_ADDRESS :
            usb_pstd_set_address3();            /* SetAddress3 */
        break;
        case USB_SET_CONFIGURATION :
            usb_pstd_set_configuration3();      /* SetConfiguration3 */
        break;
        case USB_SET_INTERFACE :
            usb_pstd_set_interface3();          /* SetInterface3 */
        break;
        default :
            usb_pstd_set_stall_pipe0();         /* Set pipe USB_PID_STALL */
        break;
    }
    if (USB_YES == g_usb_pstd_std_request)
    {
        ctrl.setup.type   = g_usb_pstd_req_type;    /* Request type */
        ctrl.setup.value  = g_usb_pstd_req_value;   /* Value */
        ctrl.setup.index  = g_usb_pstd_req_index;   /* Index */
        ctrl.setup.length = g_usb_pstd_req_length;  /* Length */
        ctrl.size   = 0;
        ctrl.status = USB_ACK;
        ctrl.type   = USB_REQUEST;
#if (BSP_CFG_RTOS_USED == 1)
        ctrl.p_data = (void *)xTaskGetCurrentTaskHandle();
#endif /* (BSP_CFG_RTOS_USED == 1) */
        usb_set_event(USB_STS_REQUEST_COMPLETE, &ctrl);

        g_usb_pstd_std_request = USB_NO;
    }
    usb_pstd_ctrl_end((uint16_t) USB_CTRL_END); /* Control transfer stop(end) */
}
/******************************************************************************
 End of function usb_pstd_stand_req3
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_stand_req4
 Description     : The control read status stage of a standard request from host.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_stand_req4 (void)
{
    usb_ctrl_t ctrl;

    switch ((g_usb_pstd_req_type & USB_BREQUEST))
    {
        case USB_GET_STATUS :

            usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);            /* GetStatus4 */
        break;
        case USB_GET_DESCRIPTOR :

            usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);            /* GetDescriptor4 */
        break;
        case USB_GET_CONFIGURATION :

            usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);            /* GetConfiguration4 */
        break;
        case USB_GET_INTERFACE :

            usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);            /* GetInterface4 */
        break;
        case USB_SYNCH_FRAME :

            usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);            /* SynchFrame4 */
        break;
        default :

            usb_pstd_set_stall_pipe0();            /* Set pipe USB_PID_STALL */
        break;
    }

    if (USB_YES == g_usb_pstd_std_request)
    {
        ctrl.setup.type   = g_usb_pstd_req_type;    /* Request type */
        ctrl.setup.value  = g_usb_pstd_req_value;   /* Value */
        ctrl.setup.index  = g_usb_pstd_req_index;   /* Index */
        ctrl.setup.length = g_usb_pstd_req_length;  /* Length */
        ctrl.size   = 0;
        ctrl.status = USB_ACK;
        ctrl.type   = USB_REQUEST;
#if (BSP_CFG_RTOS_USED == 1)
        ctrl.p_data = (void *)xTaskGetCurrentTaskHandle();
#endif /* (BSP_CFG_RTOS_USED == 1) */
        usb_set_event(USB_STS_REQUEST_COMPLETE, &ctrl);

        g_usb_pstd_std_request = USB_NO;
    }
    usb_pstd_ctrl_end((uint16_t) USB_CTRL_END);    /* Control transfer stop(end) */
}
/******************************************************************************
 End of function usb_pstd_stand_req4
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_stand_req5
 Description     : The control write status stage of a standard request from host.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_stand_req5 (void)
{
    usb_ctrl_t ctrl;

    if (USB_SET_DESCRIPTOR == (g_usb_pstd_req_type & USB_BREQUEST))
    {
        /* Set pipe PID_BUF */
        usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);
    }
    else
    {
        /* Set pipe USB_PID_STALL */
        usb_pstd_set_stall_pipe0();
    }

    if (USB_YES == g_usb_pstd_std_request)
    {
        ctrl.setup.type   = g_usb_pstd_req_type;    /* Request type */
        ctrl.setup.value  = g_usb_pstd_req_value;   /* Value */
        ctrl.setup.index  = g_usb_pstd_req_index;   /* Index */
        ctrl.setup.length = g_usb_pstd_req_length;  /* Length */

        ctrl.size   = 0;
        ctrl.status = USB_ACK;
        ctrl.type   = USB_REQUEST;
#if (BSP_CFG_RTOS_USED == 1)
        ctrl.p_data = (void *)xTaskGetCurrentTaskHandle();
#endif /* (BSP_CFG_RTOS_USED == 1) */

