renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pstdrequest.c
/******************************************************************************
 Function Name   : usb_pstd_synch_rame1
 Description     : Return STALL response to SynchFrame command.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
static void usb_pstd_synch_rame1 (void)
{
    /* Set pipe USB_PID_STALL */
    usb_pstd_set_stall_pipe0();
}
/******************************************************************************
 End of function usb_pstd_synch_rame1
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_peri_class_request
 Description     : Class request processing for Device class
 Arguments       : usb_setup_t *preq    ; Class request information
                 : uint16_t ctsq        ; Control Stage
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request(usb_setup_t *preq, uint16_t ctsq)
{
    /* Check Request type TYPE */
    if ((USB_CLASS == (preq->type & USB_BMREQUESTTYPETYPE)) || (USB_VENDOR == (preq->type & USB_BMREQUESTTYPETYPE)))
    {
        /* Branch by the Control Transfer Stage */
        switch (ctsq)
        {
            case USB_CS_IDST :
                g_usb_pstd_pipe0_request = USB_OFF;
                g_usb_pstd_std_request = USB_NO;
                usb_peri_class_request_ioss(preq);  /* class request (idle or setup stage) */
            break;

            case USB_CS_RDDS :
                usb_peri_class_request_rwds(preq);  /* class request (control read data stage) */
            break;

            case USB_CS_WRDS :
#if defined(USB_CFG_PMSC_USE)
                usb_peri_class_request_wds(preq);   /* class request (control write data stage) */
#else   /* defined(USB_CFG_PMSC_USE) */
                usb_peri_class_request_rwds(preq);  /* class request (control write data stage) */
#endif  /* defined(USB_CFG_PMSC_USE) */
            break;

            case USB_CS_WRND :
                usb_peri_class_request_wnss(preq);  /* class request (control write nodata status stage) */
            break;

            case USB_CS_RDSS :
                usb_peri_class_request_rss(preq);   /* class request (control read status stage) */
            break;

            case USB_CS_WRSS :
                usb_peri_class_request_wss(preq);   /* class request (control write status stage) */
            break;

            case USB_CS_SQER :
                usb_pstd_ctrl_end((uint16_t) USB_DATA_ERR);     /* End control transfer. */
            break;

            default :
                usb_pstd_ctrl_end((uint16_t) USB_DATA_ERR);     /* End control transfer. */
            break;
        }
    }
    else
    {
        usb_peri_other_request(preq);
    }
} /* End of function usb_peri_class_request */

/******************************************************************************
 Function Name   : usb_peri_class_request_ioss
 Description     : Class Request (idle or setup stage)
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request_ioss (usb_setup_t *req)
{
    /* Non */
} /* End of function usb_peri_class_request_ioss */

/******************************************************************************
 Function Name   : usb_peri_class_request_rwds
 Description     : Class request processing (control read/write data stage)
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request_rwds (usb_setup_t * req)
{
#if defined(USB_CFG_PMSC_USE)

    usb_ctrl_t ctrl;

    /* Is a request receive target Interface? */
    if ((0 == req->index) && (USB_INTERFACE == (req->type & USB_BMREQUESTTYPERECIP)))
    {
        if (USB_GET_MAX_LUN == (req->type & USB_BREQUEST))
        {
            usb_pmsc_get_max_lun(req->value, req->index, req->length);
        }
        else
        {
            /* Get Line Coding Request */
            ctrl.module = USB_CFG_USE_USBIP;
            ctrl.setup  = *req; /* Save setup data. */
            ctrl.size   = 0;
            ctrl.status = USB_ACK;
            ctrl.type   = USB_REQUEST;
            usb_set_event(USB_STS_REQUEST, &ctrl);
        }
    }
    else
    {
        /* Set Stall */
        usb_pstd_set_stall_pipe0(); /* Req Error */
    }

#else   /* defined(USB_CFG_PMSC_USE) */

    usb_ctrl_t ctrl;

    /* Is a request receive target Interface? */
    ctrl.module = USB_CFG_USE_USBIP;
    ctrl.setup  = *req; /* Save setup data. */
    ctrl.size   = 0;
    ctrl.status = USB_ACK;
    ctrl.type   = USB_REQUEST;
    usb_set_event(USB_STS_REQUEST, &ctrl);

#endif  /* defined(USB_CFG_PMSC_USE) */
} /* End of function usb_peri_class_request_rwds */

#if defined(USB_CFG_PMSC_USE)
/******************************************************************************
 Function Name   : usb_peri_class_request_wds
 Description     : Class request processing (control write data stage)
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request_wds (usb_setup_t * req)
{
    usb_pstd_set_stall_pipe0();
} /* End of function usb_peri_class_request_wds */
#endif  /* defined(USB_CFG_PMSC_USE) */

/******************************************************************************
 Function Name   : usb_peri_other_request
 Description     : Processing to notify the reception of the USB request
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_other_request (usb_setup_t *req)
{
    usb_ctrl_t ctrl;

    ctrl.type   = USB_REQUEST;
    ctrl.setup  = *req; /* Save setup data. */
    ctrl.module = USB_CFG_USE_USBIP;
    ctrl.size   = 0;
    ctrl.status = USB_ACK;
    usb_set_event(USB_STS_REQUEST, &ctrl);
} /* End of function usb_peri_other_request */

