renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pstdrequest.c
/******************************************************************************
 Function Name   : usb_peri_class_request_wnss
 Description     : class request (control write nodata status stage)
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request_wnss (usb_setup_t *req)
{
#if defined(USB_CFG_PMSC_USE)

    /* Is a request receive target Interface? */
    if ((0 == req->index) && (USB_INTERFACE == (req->type & USB_BMREQUESTTYPERECIP)))
    {
        if (USB_MASS_STORAGE_RESET == (req->type & USB_BREQUEST))
        {
            usb_pmsc_mass_strage_reset (req->value, req->index, req->length);
        }
        else
        {
            usb_pstd_set_stall_pipe0(); /* Req Error */
        }
    }
    else
    {
        usb_pstd_set_stall_pipe0(); /* Req Error */
    }

    if (USB_MASS_STORAGE_RESET != (req->type & USB_BREQUEST))
    {
        usb_pstd_ctrl_end((uint16_t) USB_CTRL_END); /* End control transfer. */
    }

#else   /* defined(USB_CFG_PMSC_USE) */

    usb_ctrl_t ctrl;

    /* Is a request receive target Interface? */
    ctrl.setup  = *req; /* Save setup data. */
    ctrl.module = USB_CFG_USE_USBIP;
    ctrl.size   = 0;
    ctrl.status = USB_ACK;
    ctrl.type   = USB_REQUEST;
    usb_set_event(USB_STS_REQUEST, &ctrl);

    usb_pstd_ctrl_end((uint16_t) USB_CTRL_END); /* End control transfer. */

#endif  /* defined(USB_CFG_PMSC_USE) */

} /* End of function usb_peri_class_request_wnss */

/******************************************************************************
 Function Name   : usb_peri_class_request_rss
 Description     : class request (control read status stage)
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request_rss (usb_setup_t *req)
{
#if defined(USB_CFG_PMSC_USE)
    /* Is a request receive target Interface? */
    usb_ctrl_t ctrl;

    if (USB_GET_MAX_LUN == (req->type & USB_BREQUEST))
    {
        usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0);
    }
    else
    {
        ctrl.setup  = *req; /* Save setup data. */
        usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0); /* Set pipe PID_BUF */
        ctrl.module = USB_CFG_USE_USBIP;
        ctrl.size   = 0;
        ctrl.status = USB_ACK;
        ctrl.type   = USB_REQUEST;
#if (BSP_CFG_RTOS_USED == 1)
        ctrl.p_data = (void *)xTaskGetCurrentTaskHandle();
#endif /* (BSP_CFG_RTOS_USED == 1) */
        usb_set_event(USB_STS_REQUEST_COMPLETE, &ctrl);
        g_usb_pstd_std_request = USB_NO;
    }

    usb_pstd_ctrl_end((uint16_t) USB_CTRL_END); /* End control transfer. */

#else   /* defined(USB_CFG_PMSC_USE) */

    /* Is a request receive target Interface? */
    usb_ctrl_t ctrl;

    ctrl.setup  = *req; /* Save setup data. */
    usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0); /* Set pipe PID_BUF */
    ctrl.module = USB_CFG_USE_USBIP;
    ctrl.size   = 0;
    ctrl.status = USB_ACK;
    ctrl.type   = USB_REQUEST;
#if (BSP_CFG_RTOS_USED == 1)
    ctrl.p_data = (void *)xTaskGetCurrentTaskHandle();
#endif /* (BSP_CFG_RTOS_USED == 1) */
    usb_set_event(USB_STS_REQUEST_COMPLETE, &ctrl);
    g_usb_pstd_std_request = USB_NO;

    usb_pstd_ctrl_end((uint16_t) USB_CTRL_END); /* End control transfer. */

#endif  /* defined(USB_CFG_PMSC_USE) */
} /* End of function usb_peri_class_request_rss */

/******************************************************************************
 Function Name   : usb_peri_class_request_wss
 Description     : class request (control write status stage)
 Arguments       : usb_setup_t *req : Pointer to usb_setup_t structure
 Return value    : none
 ******************************************************************************/
void usb_peri_class_request_wss (usb_setup_t *req)
{
    usb_ctrl_t ctrl;

    ctrl.setup = *req;
    usb_cstd_set_buf(USB_NULL, (uint16_t) USB_PIPE0); /* Set BUF */
    ctrl.module = USB_CFG_USE_USBIP;
    ctrl.size   = ctrl.setup.length - g_usb_pstd_data_cnt[USB_PIPE0];
    ctrl.status = USB_ACK;
    ctrl.type   = USB_REQUEST;
#if (BSP_CFG_RTOS_USED == 1)
    ctrl.p_data = (void *)xTaskGetCurrentTaskHandle();
#endif /* (BSP_CFG_RTOS_USED == 1) */
    usb_set_event(USB_STS_REQUEST_COMPLETE, &ctrl);
    g_usb_pstd_std_request = USB_NO;

    usb_pstd_ctrl_end((uint16_t) USB_CTRL_END);
} /* End of function usb_peri_class_request_wss */

#if USB_CFG_REQUEST == USB_CFG_ENABLE
/******************************************************************************
 Function Name   : usb_pstd_request_event_set
 Description     : 
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_request_event_set (void)
{
    usb_ctrl_t ctrl;

    ctrl.setup.type   = g_usb_pstd_req_type;    /* Request type */
    ctrl.setup.value  = g_usb_pstd_req_value;   /* Value */
    ctrl.setup.index  = g_usb_pstd_req_index;   /* Index */
    ctrl.setup.length = g_usb_pstd_req_length;  /* Length */
    ctrl.size         = 0;
    ctrl.status       = USB_ACK;
    ctrl.type         = USB_REQUEST;
    usb_set_event(USB_STS_REQUEST, &ctrl);
} /* End of function usb_pstd_request_event_set */
#endif /* USB_CFG_REQUEST == USB_CFG_ENABLE */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

/******************************************************************************
 End  Of File
 ******************************************************************************/
